11-async.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Asynchronous Operations</title>
<!-- 2021-03-24 Wed 17:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Asynchronous Operations</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Asynchronous Operations</a>
<ul>
<li><a href="#sec-1-1">1.1. Using callbacks</a></li>
<li><a href="#sec-1-2">1.2. Using promises</a></li>
<li><a href="#sec-1-3">1.3. Async/await</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Asynchronous Operations</h2>
<div class="outline-text-2" id="text-1">
<p>
All of our code up until now has involved purely <b>synchronous</b> operations. Every operation we run, or function we call, gives us back a result (or produces some output) by the time it is finished running. Operations are normally synchronized with each other: each operation waits to start only after the previous one is finished.
</p>

<div class="org-src-container">

<pre class="src src-js">console.log('first');

const fruits = ['apple', 'banana', 'cherry'];
console.log(fruits);

console.log('last');
</pre>
</div>

<p>
If we run the above code, we will see the output in the order we expect: <code>first</code>, followed by the fruits, and finally <code>last</code>.
</p>

<p>
On the other hand, <b>asynchronous</b> operations do not wait for other operations to finish; they run whenever they are ready. Asynchronous operations come about in two circumstances:
</p>
<ul class="org-ul">
<li>when specific timing is involved, or
</li>
<li>when dealing with external data (any data from outside of our JavaScript code).
</li>
</ul>

<p>
There are three ways of handling asynchronous operations: callbacks, promises, and async/await (which is simplified syntax for using promises).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Using callbacks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>setTimeout()</code> is an asynchronous function that takes two arguments: a callback function and a number of milliseconds. The callback will run after the specified number of milliseconds. The reason <code>setTimeout()</code> takes a callback as an argument is to allow for some action to be performed after some time. To be flexible (i.e. to allow for any action), a function makes the most sense here. Callbacks are often used for asynchronous operations for exactly this reason. However, using callbacks is not evidence of asynchronous code. As we have seen before, callbacks are frequently used in synchronous code as well.
</p>

<p>
Let's try mixing some asynchronous code into the previous example.
</p>

<div class="org-src-container">

<pre class="src src-js">console.log('first');

const fruits = ['apple', 'banana', 'cherry'];

setTimeout(() =&gt; {
  console.log(fruits);
}, 1000);

console.log('last');
</pre>
</div>

<p>
Now, even though the code to print the fruits comes before the code to print <code>last</code>, we will see <code>last</code> show up before the fruits in the output. In fact, it will take one second (1000 milliseconds) before the fruits show up. Even if we set the timeout delay to 0, the fruits will still be the last to print. This is because <i>asynchronous code only runs after all of the synchronous code is finished</i>. In running the above example, when it comes to the <code>setTimeout()</code> code, the callback is put aside, into an imaginary asynchronous box, and then the program carries on with the rest of the synchronous code. After all of the synchronous code is finished, everything inside the asynchronous box gets to run.
</p>

<div class="org-src-container">

<pre class="src src-js">console.log('first');

const fruits = ['apple', 'banana', 'cherry'];

fruits.forEach(fruit =&gt; {
  console.log(fruit);
});

console.log('last');
</pre>
</div>

<p>
The above code uses a callback to print the fruit, but there are no asynchronous operations going on. The output order is the same as in the first example: <code>first</code>, the fruits, then <code>last</code>.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Using promises</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Promises</b> are special objects for dealing with asynchronous operations. A promise has three potential states: pending, fulfilled, and rejected. This suits the pattern of what happens when dealing with external data. Let's say we want to simply read in the contents of a text file on our computer. The operation 'read in the contents of myFile.txt' will first be pending while node looks for <code>myFile.txt</code> (this is what makes it asynchronous). Once the file is found and its contents are read in, the operation is fulfilled and we can then do what we want with the contents. If instead the file is not found because it doesn't exist, the operation is rejected and we can print an message saying so.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Async/await</h3>
</div>
</div>
</div>
</body>
</html>
